Revit 2026 API

# TableCellStyle(TableCellStyle) Constructor

---

Constructs a new copy of the input TableCellStyle object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public TableCellStyle(
	TableCellStyle other
)
```
```vb
Public Sub New (
	other As TableCellStyle
)
```
```cpp
public:
TableCellStyle(
	TableCellStyle^ other
)
```
```fsharp
new :
        other : TableCellStyle -> TableCellStyle
```

#### Parameters

other TableCellStyle

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TableCellStyle Class

TableCellStyle Overload

Autodesk.Revit.DB Namespace